<<<<<<< HEAD
# java 에서 printf 와 비슷하다.
# print(형식문자열 % 데이터) - 출력 후 줄바꿈을 한다.
# %d - 정수형 데이터 출력
print("%d입니다." % 123)
print("%d입니다." % 123)
print("%5d입니다." % 123)
print("%05d입니다." % 123)

# %f - 실수형 데이터 출력
print("%f입니다." % 123.45)
# print("%전체자리수.소수점이하 f") - 기본은 반올림한다.
print("%7.1f입니다." % 123.45)
print("%.3f입니다." % 123.45)

# %s - 문자열 데이터 출력
print("%s" % "Python")
print("%10s" % 'Python')
=======
# java 에서 printf 와 비슷하다.
# print(형식문자열 % 데이터) - 출력 후 줄바꿈을 한다.
# %d - 정수형 데이터 출력
print("%d입니다." % 123)
print("%d입니다." % 123)
print("%5d입니다." % 123)
print("%05d입니다." % 123)

# %f - 실수형 데이터 출력
print("%f입니다." % 123.45)
# print("%전체자리수.소수점이하 f") - 기본은 반올림한다.
print("%7.1f입니다." % 123.45)
print("%.3f입니다." % 123.45)

# %s - 문자열 데이터 출력
print("%s" % "Python")
print("%10s" % 'Python')
>>>>>>> 43255137ff05baca5be93f562c5605cc35851e4d
